zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_C.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_XRDC_C.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_XRDC_C
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_XRDC_C_H_)  /* Check if memory map has not been already included */
#define S32K566_XRDC_C_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- XRDC_C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_C_Peripheral_Access_Layer XRDC_C Peripheral Access Layer
 * @{
 */

/** XRDC_C - Size of Registers Arrays */
#define XRDC_C_MDAC_COUNT                         1u
#define XRDC_C_MRC_COUNT                          1u
#define XRDC_C_DERRLOC_COUNT                      16u
#define XRDC_C_DERRW0_COUNT                       23u
#define XRDC_C_PDACN0_COUNT                       59u
#define XRDC_C_PDACN1_COUNT                       61u
#define XRDC_C_PDACN2_COUNT                       64u
#define XRDC_C_PDACN3_COUNT                       62u
#define XRDC_C_MRCN_COUNT                         1u
#define XRDC_C_MRCN_MRGDN_COUNT                   4u
#define XRDC_C_PDACN4_COUNT                       54u
#define XRDC_C_PDACN5_COUNT                       60u
#define XRDC_C_PDACN6_COUNT                       53u

/** XRDC_C - Register Layout Typedef */
typedef struct XRDC_C_Struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
  uint8_t RESERVED_0[236];
  __I  uint32_t HWCFG0;                            /**< Hardware Configuration 0, offset: 0xF0 */
  __I  uint32_t HWCFG1;                            /**< Hardware Configuration 1, offset: 0xF4 */
  __I  uint32_t HWCFG2;                            /**< Hardware Configuration 2, offset: 0xF8 */
  uint8_t RESERVED_1[4];
  __I  uint8_t MDACFG[XRDC_C_MDAC_COUNT];          /**< Master Domain Assignment Configuration, array offset: 0x100, array step: 0x1 */
  uint8_t RESERVED_2[63];
  __I  uint8_t MRCFG[XRDC_C_MRC_COUNT];            /**< Memory Region Configuration, array offset: 0x140, array step: 0x1 */
  uint8_t RESERVED_3[191];
  __I  uint32_t DERRLOC[XRDC_C_DERRLOC_COUNT];     /**< Domain Error Location, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_4[448];
  struct XRDC_C_DERRW0 {                           /* offset: 0x400, array step: 0x10 */
    __I  uint32_t DERR_W0;                           /**< Domain Error Word 0, array offset: 0x400, array step: 0x10, valid indices: [0, 16-22] */
    __I  uint32_t DERR_W1;                           /**< Domain Error Word 1, array offset: 0x404, array step: 0x10, valid indices: [0, 16-22] */
    uint8_t RESERVED_0[4];
    __IO uint32_t DERR_W3;                           /**< Domain Error Word 3, array offset: 0x40C, array step: 0x10, valid indices: [0, 16-22] */
  } DERRW0[XRDC_C_DERRW0_COUNT];
  uint8_t RESERVED_5[656];
  __IO uint32_t MDA_W0_0_DFMT1;                    /**< Master Domain Assignment, offset: 0x800 */
  __IO uint32_t MDA_W1_0_DFMT1;                    /**< Master Domain Assignment, offset: 0x804 */
  __IO uint32_t MDA_W2_0_DFMT1;                    /**< Master Domain Assignment, offset: 0x808 */
  __IO uint32_t MDA_W3_0_DFMT1;                    /**< Master Domain Assignment, offset: 0x80C */
  uint8_t RESERVED_6[2032];
  struct XRDC_C_PDACN0 {                           /* offset: 0x1000, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1000, array step: 0x8, valid indices: [58] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1004, array step: 0x8, valid indices: [58] */
  } PDACN0[XRDC_C_PDACN0_COUNT];
  uint8_t RESERVED_7[552];
  struct XRDC_C_PDACN1 {                           /* offset: 0x1400, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1400, array step: 0x8, valid indices: [0-32, 36-47, 50-57, 59-60] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1404, array step: 0x8, valid indices: [0-32, 36-47, 50-57, 59-60] */
  } PDACN1[XRDC_C_PDACN1_COUNT];
  uint8_t RESERVED_8[536];
  struct XRDC_C_PDACN2 {                           /* offset: 0x1800, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1800, array step: 0x8, valid indices: [35, 48-49, 63] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1804, array step: 0x8, valid indices: [35, 48-49, 63] */
  } PDACN2[XRDC_C_PDACN2_COUNT];
  uint8_t RESERVED_9[512];
  struct XRDC_C_PDACN3 {                           /* offset: 0x1C00, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1C00, array step: 0x8, valid indices: [3-35, 38-46, 49-50, 59-61] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1C04, array step: 0x8, valid indices: [3-35, 38-46, 49-50, 59-61] */
  } PDACN3[XRDC_C_PDACN3_COUNT];
  uint8_t RESERVED_10[528];
  struct XRDC_C_MRGDN {                            /* offset: 0x2000, array step: index*0x80, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W0;                      /**< Memory Region Descriptor Word 0, array offset: 0x2000, array step: index*0x80, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W1;                      /**< Memory Region Descriptor Word 1, array offset: 0x2004, array step: index*0x80, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W2;                      /**< Memory Region Descriptor Word 2, array offset: 0x2008, array step: index*0x80, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W3;                      /**< Memory Region Descriptor Word 3, array offset: 0x200C, array step: index*0x80, index2*0x20 */
    uint8_t RESERVED_0[16];
  } MRGDN[XRDC_C_MRCN_COUNT][XRDC_C_MRCN_MRGDN_COUNT];
  uint8_t RESERVED_11[8064];
  struct XRDC_C_PDACN4 {                           /* offset: 0x4000, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x4000, array step: 0x8, valid indices: [0, 36, 47-48, 51-53] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x4004, array step: 0x8, valid indices: [0, 36, 47-48, 51-53] */
  } PDACN4[XRDC_C_PDACN4_COUNT];
  uint8_t RESERVED_12[592];
  struct XRDC_C_PDACN5 {                           /* offset: 0x4400, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x4400, array step: 0x8, valid indices: [0-32, 35-44, 46, 58-59] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x4404, array step: 0x8, valid indices: [0-32, 35-44, 46, 58-59] */
  } PDACN5[XRDC_C_PDACN5_COUNT];
  uint8_t RESERVED_13[544];
  struct XRDC_C_PDACN6 {                           /* offset: 0x4800, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x4800, array step: 0x8, valid indices: [45, 49-52] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x4804, array step: 0x8, valid indices: [45, 49-52] */
  } PDACN6[XRDC_C_PDACN6_COUNT];
} XRDC_C_Type, *XRDC_C_MemMapPtr;

