zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_C.h
#define XRDC_C_MDA_W0_0_DFMT1_VLD_MASK           (0x80000000U)
#define XRDC_C_MDA_W0_0_DFMT1_VLD_SHIFT          (31U)
#define XRDC_C_MDA_W0_0_DFMT1_VLD_WIDTH          (1U)
#define XRDC_C_MDA_W0_0_DFMT1_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W0_0_DFMT1_VLD_SHIFT)) & XRDC_C_MDA_W0_0_DFMT1_VLD_MASK)
/*! @} */

/*! @name MDA_W1_0_DFMT1 - Master Domain Assignment */
/*! @{ */

#define XRDC_C_MDA_W1_0_DFMT1_DID_MASK           (0xFU)
#define XRDC_C_MDA_W1_0_DFMT1_DID_SHIFT          (0U)
#define XRDC_C_MDA_W1_0_DFMT1_DID_WIDTH          (4U)
#define XRDC_C_MDA_W1_0_DFMT1_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_DID_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_DID_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_PA_MASK            (0x30U)
#define XRDC_C_MDA_W1_0_DFMT1_PA_SHIFT           (4U)
#define XRDC_C_MDA_W1_0_DFMT1_PA_WIDTH           (2U)
#define XRDC_C_MDA_W1_0_DFMT1_PA(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_PA_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_PA_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_SA_MASK            (0xC0U)
#define XRDC_C_MDA_W1_0_DFMT1_SA_SHIFT           (6U)
#define XRDC_C_MDA_W1_0_DFMT1_SA_WIDTH           (2U)
#define XRDC_C_MDA_W1_0_DFMT1_SA(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_SA_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_SA_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_DIDB_MASK          (0x100U)
#define XRDC_C_MDA_W1_0_DFMT1_DIDB_SHIFT         (8U)
#define XRDC_C_MDA_W1_0_DFMT1_DIDB_WIDTH         (1U)
#define XRDC_C_MDA_W1_0_DFMT1_DIDB(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_DIDB_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_DIDB_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_LPID_MASK          (0xF000000U)
#define XRDC_C_MDA_W1_0_DFMT1_LPID_SHIFT         (24U)
#define XRDC_C_MDA_W1_0_DFMT1_LPID_WIDTH         (4U)
#define XRDC_C_MDA_W1_0_DFMT1_LPID(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_LPID_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_LPID_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_LPE_MASK           (0x10000000U)
#define XRDC_C_MDA_W1_0_DFMT1_LPE_SHIFT          (28U)
#define XRDC_C_MDA_W1_0_DFMT1_LPE_WIDTH          (1U)
#define XRDC_C_MDA_W1_0_DFMT1_LPE(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_LPE_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_LPE_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_DFMT_MASK          (0x20000000U)
#define XRDC_C_MDA_W1_0_DFMT1_DFMT_SHIFT         (29U)
#define XRDC_C_MDA_W1_0_DFMT1_DFMT_WIDTH         (1U)
#define XRDC_C_MDA_W1_0_DFMT1_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_DFMT_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_DFMT_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_LK1_MASK           (0x40000000U)
#define XRDC_C_MDA_W1_0_DFMT1_LK1_SHIFT          (30U)
#define XRDC_C_MDA_W1_0_DFMT1_LK1_WIDTH          (1U)
#define XRDC_C_MDA_W1_0_DFMT1_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_LK1_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_LK1_MASK)

#define XRDC_C_MDA_W1_0_DFMT1_VLD_MASK           (0x80000000U)
#define XRDC_C_MDA_W1_0_DFMT1_VLD_SHIFT          (31U)
#define XRDC_C_MDA_W1_0_DFMT1_VLD_WIDTH          (1U)
#define XRDC_C_MDA_W1_0_DFMT1_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W1_0_DFMT1_VLD_SHIFT)) & XRDC_C_MDA_W1_0_DFMT1_VLD_MASK)
/*! @} */

/*! @name MDA_W2_0_DFMT1 - Master Domain Assignment */
/*! @{ */

#define XRDC_C_MDA_W2_0_DFMT1_DID_MASK           (0xFU)
#define XRDC_C_MDA_W2_0_DFMT1_DID_SHIFT          (0U)
#define XRDC_C_MDA_W2_0_DFMT1_DID_WIDTH          (4U)
#define XRDC_C_MDA_W2_0_DFMT1_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_DID_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_DID_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_PA_MASK            (0x30U)
#define XRDC_C_MDA_W2_0_DFMT1_PA_SHIFT           (4U)
#define XRDC_C_MDA_W2_0_DFMT1_PA_WIDTH           (2U)
#define XRDC_C_MDA_W2_0_DFMT1_PA(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_PA_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_PA_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_SA_MASK            (0xC0U)
#define XRDC_C_MDA_W2_0_DFMT1_SA_SHIFT           (6U)
#define XRDC_C_MDA_W2_0_DFMT1_SA_WIDTH           (2U)
#define XRDC_C_MDA_W2_0_DFMT1_SA(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_SA_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_SA_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_DIDB_MASK          (0x100U)
#define XRDC_C_MDA_W2_0_DFMT1_DIDB_SHIFT         (8U)
#define XRDC_C_MDA_W2_0_DFMT1_DIDB_WIDTH         (1U)
#define XRDC_C_MDA_W2_0_DFMT1_DIDB(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_DIDB_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_DIDB_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_LPID_MASK          (0xF000000U)
#define XRDC_C_MDA_W2_0_DFMT1_LPID_SHIFT         (24U)
#define XRDC_C_MDA_W2_0_DFMT1_LPID_WIDTH         (4U)
#define XRDC_C_MDA_W2_0_DFMT1_LPID(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_LPID_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_LPID_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_LPE_MASK           (0x10000000U)
#define XRDC_C_MDA_W2_0_DFMT1_LPE_SHIFT          (28U)
#define XRDC_C_MDA_W2_0_DFMT1_LPE_WIDTH          (1U)
#define XRDC_C_MDA_W2_0_DFMT1_LPE(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_LPE_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_LPE_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_DFMT_MASK          (0x20000000U)
#define XRDC_C_MDA_W2_0_DFMT1_DFMT_SHIFT         (29U)
#define XRDC_C_MDA_W2_0_DFMT1_DFMT_WIDTH         (1U)
#define XRDC_C_MDA_W2_0_DFMT1_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_DFMT_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_DFMT_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_LK1_MASK           (0x40000000U)
#define XRDC_C_MDA_W2_0_DFMT1_LK1_SHIFT          (30U)
#define XRDC_C_MDA_W2_0_DFMT1_LK1_WIDTH          (1U)
#define XRDC_C_MDA_W2_0_DFMT1_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_LK1_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_LK1_MASK)

#define XRDC_C_MDA_W2_0_DFMT1_VLD_MASK           (0x80000000U)
#define XRDC_C_MDA_W2_0_DFMT1_VLD_SHIFT          (31U)
#define XRDC_C_MDA_W2_0_DFMT1_VLD_WIDTH          (1U)
#define XRDC_C_MDA_W2_0_DFMT1_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W2_0_DFMT1_VLD_SHIFT)) & XRDC_C_MDA_W2_0_DFMT1_VLD_MASK)
/*! @} */

/*! @name MDA_W3_0_DFMT1 - Master Domain Assignment */
/*! @{ */

#define XRDC_C_MDA_W3_0_DFMT1_DID_MASK           (0xFU)
#define XRDC_C_MDA_W3_0_DFMT1_DID_SHIFT          (0U)
#define XRDC_C_MDA_W3_0_DFMT1_DID_WIDTH          (4U)
#define XRDC_C_MDA_W3_0_DFMT1_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_DID_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_DID_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_PA_MASK            (0x30U)
#define XRDC_C_MDA_W3_0_DFMT1_PA_SHIFT           (4U)
#define XRDC_C_MDA_W3_0_DFMT1_PA_WIDTH           (2U)
#define XRDC_C_MDA_W3_0_DFMT1_PA(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_PA_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_PA_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_SA_MASK            (0xC0U)
#define XRDC_C_MDA_W3_0_DFMT1_SA_SHIFT           (6U)
#define XRDC_C_MDA_W3_0_DFMT1_SA_WIDTH           (2U)
#define XRDC_C_MDA_W3_0_DFMT1_SA(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_SA_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_SA_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_DIDB_MASK          (0x100U)
#define XRDC_C_MDA_W3_0_DFMT1_DIDB_SHIFT         (8U)
#define XRDC_C_MDA_W3_0_DFMT1_DIDB_WIDTH         (1U)
#define XRDC_C_MDA_W3_0_DFMT1_DIDB(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_DIDB_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_DIDB_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_LPID_MASK          (0xF000000U)
#define XRDC_C_MDA_W3_0_DFMT1_LPID_SHIFT         (24U)
#define XRDC_C_MDA_W3_0_DFMT1_LPID_WIDTH         (4U)
#define XRDC_C_MDA_W3_0_DFMT1_LPID(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_LPID_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_LPID_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_LPE_MASK           (0x10000000U)
#define XRDC_C_MDA_W3_0_DFMT1_LPE_SHIFT          (28U)
#define XRDC_C_MDA_W3_0_DFMT1_LPE_WIDTH          (1U)
#define XRDC_C_MDA_W3_0_DFMT1_LPE(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_LPE_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_LPE_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_DFMT_MASK          (0x20000000U)
#define XRDC_C_MDA_W3_0_DFMT1_DFMT_SHIFT         (29U)
#define XRDC_C_MDA_W3_0_DFMT1_DFMT_WIDTH         (1U)
#define XRDC_C_MDA_W3_0_DFMT1_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_DFMT_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_DFMT_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_LK1_MASK           (0x40000000U)
#define XRDC_C_MDA_W3_0_DFMT1_LK1_SHIFT          (30U)
#define XRDC_C_MDA_W3_0_DFMT1_LK1_WIDTH          (1U)
#define XRDC_C_MDA_W3_0_DFMT1_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_LK1_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_LK1_MASK)

#define XRDC_C_MDA_W3_0_DFMT1_VLD_MASK           (0x80000000U)
#define XRDC_C_MDA_W3_0_DFMT1_VLD_SHIFT          (31U)
#define XRDC_C_MDA_W3_0_DFMT1_VLD_WIDTH          (1U)
#define XRDC_C_MDA_W3_0_DFMT1_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_C_MDA_W3_0_DFMT1_VLD_SHIFT)) & XRDC_C_MDA_W3_0_DFMT1_VLD_MASK)
/*! @} */

